{"Asthmatic - the first asthma weather forecast": [{"rating": 4, "review": "Helpful app though I do have to admit it's a tad amusing that it doesn't factor in severe weather. A category 2 hurricane is hitting us this evening and the app says 'light rain' and wind speeds of 7mph. Lol. It's more like 90mph!", "timestamp": 1507387890}, {"rating": 1, "review": "Local agencies warning about air quality right now because of several fires in the area. Other apps showing the air quality as virtually terrible. Don't even need any of them right now. Just look outside the smoke is so thick. And yet THIS APP says the air quality is high and I should go out and enjoy the outdoors... despite saying that there's smoke in the area. Since this app is to help those with a health issue, the developers might want to call it quits before someone actually takes them seriously.", "timestamp": 1502075906}, {"rating": 2, "review": "Okay so they have the weather mostly correct but the app needs to take other things into consideration. So right now my app says the weather is perfect and air quality is high, but it definitely is not. There are brush fires all over Southern California right now and the city I live in is filled with smoke. I've already used Qvar and my nebulizer today.", "timestamp": 1498743972}, {"rating": 5, "review": "Great app. Have been using it for a week and it does a great job so far. Easy to use.", "timestamp": 1492502823}, {"rating": 3, "review": "Had I found a place to report a bug, I would have done so. I'm in Bradenton Florida, USA. the current temperature is 79°F, the current humidity is 57%. This program advised me that the temperature is 39.2°F with a humidity of 52%. It said I should wear a scarf because it's cold outside. I have hope that this app will be useful, once it locates me correctly.\n\n4/13 Thanks for the prompt response. I added a couple of stars. I'm looking forward to the next update.", "timestamp": 1492099615}, {"rating": 5, "review": "Adequate, fast and userfriendly", "timestamp": 1492019592}, {"rating": 5, "review": "Just downloaded the app and it works great. Hopefully this will help me manage my asthma. I'll keep using it.", "timestamp": 1491976891}, {"rating": 1, "review": "Unable to download the application. What's up with that?", "timestamp": 1491964873}, {"rating": 1, "review": "Loaded it twice...doesn't do anything. Glad I didn't spend any money on it.", "timestamp": 1491948301}, {"rating": 2, "review": "I'm really not sure what's going on, but The app does not pull up the correct weather data for my location or the neighboring metro area. In fact the data it's pulling up is over 50° off. The credits indicate that open weather map is the source so I checked their data and it appears to be correct for my location. If the weather data for your location is correct that I am sure this is an amazing app! Sadly that is not the case for me.", "timestamp": 1491947919}, {"rating": 2, "review": "Might be a nice app if it covered where you live. For North Carolina USA it only gives info for some unnamed location that has to be in the mountains. When it is 74 where I live it tells me the temperature is 37.", "timestamp": 1491947356}, {"rating": 1, "review": "The app tells me to wear a scarf outside because it's 39.2° outside at my location (verified the app accepted the correct location). In reality, it is 82° at my location. Delete!!", "timestamp": 1491941040}, {"rating": 1, "review": "Just installed it - after paying!  Can't get it to come up on my iPad ... or work", "timestamp": 1491594641}, {"rating": 5, "review": "As a parent of an asthma sufferer, knowing in advance when we will have red/yellow/green days is immensely helpful! What a great app!", "timestamp": 1485381977}, {"rating": 4, "review": "As a new asthmatic and a cross country runner, I have found this app extremely helpful. My one problem is the humidity always seems to be a little higher than normal. Other than that the app is amazing!!!", "timestamp": 1473724702}, {"rating": 4, "review": "As a lifelong asthmatic and avid distance runner, this app is really helpful in planning my workout schedule. I consult it for deciding between the treadmill or the road. I really like the concept and wish this type of technology existed when I was a kid just learning about my asthma. Few suggestions: make the temperature information available in Fahrenheit, make hour-to-hour information as often times weather quality for asthmatics varies from afternoon to evening, etc. Great start though!", "timestamp": 1469375565}, {"rating": 2, "review": "I have been unable to add any major USA Locations.", "timestamp": 1466188033}, {"rating": 4, "review": "That would make it perfect", "timestamp": 1462913791}], "My Asthma Manager": [{"rating": 2, "review": "This app captures the key asthma indicators.  I finally figured out how to save my notes but I could never generate a graph.  Their help was no help in this area.  After two months of feeding the app I deleted it.  AsthmaTrack is much more useful.", "timestamp": 1512773279}], "STAT Asthma NHLBI Guidelines": [{"rating": 4, "review": "This is a wonderful app- I use it several times throughout the day- well I did before my iOS updated and now I can't. PLEASE PLEASE UPDATE SO WE CAN KEEP USING!!!!", "timestamp": 1520978128}, {"rating": 5, "review": "this is a great app. i was recommending it to someone today, but it has not been updated so I could not show it to them.", "timestamp": 1518644475}, {"rating": 1, "review": "Please update app to work on iOS 11.", "timestamp": 1516213122}, {"rating": 5, "review": "Worked well until recently. Will not work on update iOS", "timestamp": 1513652084}, {"rating": 3, "review": "Needs updated for iOS", "timestamp": 1512915699}, {"rating": 3, "review": "Wasn't totally FREE app cost $6.99 to upgrade then doesn't have the classification for Dx. Oh well.", "timestamp": 1347229879}, {"rating": 5, "review": "attempted to upgrade via in-app purchase, which confirmed the purchase but failed to remove the banner ads.", "timestamp": 1305113744}, {"rating": 4, "review": "Very nice use of current evidence-based care for asthma.  This app would very much benefit from being able to identify asthma severity and/or level of control based on input of symptoms", "timestamp": 1275682179}, {"rating": 3, "review": "The app does not give you the actual classification of current asthma severity i.e intermittent vs mild/ mod/ severe persistent asthma. This is part of diagnosis in the guidelines. The app only gives you the next step.", "timestamp": 1263220504}, {"rating": 5, "review": "The in-app upgrade was a bit unexpected, but acceptable. The basic function is all I'd need. At the end of the day, this is great for what it is!", "timestamp": 1260830516}], "Asthma Storylines": [{"rating": 4, "review": "Was a bit hard to locate this tool module Tools-> show all -> asthma. It uses a slider bar which is more clumsy than entering a digital amount, it looks like it will graph the results too! \nWith so many modules to track different issues his could be a really helpful app to keep everything at a glance.", "timestamp": 1493657433}, {"rating": 3, "review": "I like it", "timestamp": 1485050023}, {"rating": 2, "review": "Would give this higher stars but it crashes a lot and is very frustrating.  Would be nice to be able to edit entries but can't. Set up great but issues need to be fixed including editing.", "timestamp": 1451573571}], "Asthma Journal Free": [{"rating": 1, "review": "So it's useless because it freezes every time I use it.", "timestamp": 1470559140}, {"rating": 1, "review": "If you don't purchase the full version don't waste your time with this one.", "timestamp": 1451573376}, {"rating": 1, "review": "Never worked, locks up constantly. Deleting", "timestamp": 1429035900}, {"rating": 2, "review": "Does not save data, or allow for export...", "timestamp": 1396886946}, {"rating": 3, "review": "I have asthma so it is helpful. To get multiple people u have to make separate journal entries for separate people.", "timestamp": 1334742309}, {"rating": 2, "review": "I need for this App to keep up with my 3 kids asthma for Lebonheur childrens hospital. App is great but I need to be able to add multiple people as well as multiple peak flow readings. If I missed how to do someone please let me know:/", "timestamp": 1314777053}, {"rating": 2, "review": "It shows an am and pm flow reading in the pics, but not in actual app. Would be nice to enter as many as I like, but twice per day is what my doc asked for, so this app won't work for me.", "timestamp": 1290219405}], "Asthma Explorers Club": [{"rating": 5, "review": "Fabulous educational tool that support and informs kids and their parents about living with asthma. The videos are relevant and exceptional in all of the information they provide. The ask the doc questions and answers are thorough and cover a vast amount if information. Great educational resource.", "timestamp": 1412714082}, {"rating": 5, "review": "Wonderful resource for children and families living with asthma and allergies. Information is very thorough and supportive.", "timestamp": 1412712779}, {"rating": 5, "review": "I thoroughly enjoy this educational and innovative asthma app. It helps kids understand asthma in a fun and friendly manner", "timestamp": 1412684306}, {"rating": 5, "review": "Asthma can be scary for a child and difficult to explain some times. The videos were were a fun, friendly and educational.", "timestamp": 1412603688}], "asthmaTrack": [{"rating": 4, "review": "My asthma moved from mild to moderate and it was time for me to take it more seriously.  I searched for an app to track my symptoms and this is the best one.\n\nHighly customizable and helps me track my symptoms, test results and triggers.  I pull up graphs to look for trends.", "timestamp": 1512773934}, {"rating": 1, "review": "Great concept but does not work consistently. When I try to personalize medications it does not save.  When I try to enter symptoms, etc, it only date/time stamps.", "timestamp": 1454270214}, {"rating": 5, "review": "If you are looking for an asthma tracker that allows input for anything that can cause issues with your asthma, this is it!  It is customizable to meet your needs with input, meds and anything else that is going on (weather, life changes etc).  The export out via e-mail that includes the diary info plus a graph of PFV/FEV1 is awesome.  The only problem is a bit of incompatibility with bluetooth keyboards on the ipad.  Some of the keys on the keyboard don't transfer to the app which results in the app locking up, but if you use the on screen keyboard, it works flawlessly.  Fantastic response from the developers also-they have added the keyboard issue to their list.  The iphone app works just as well and the iCloud sync is great!  I was able to enter info on my phone and it transferred to my ipad and was there when I opened it up as well.  Super, super app and definitely something I anticipate using for a long time.", "timestamp": 1422557832}, {"rating": 5, "review": "Tracks data well. Defaults we'll thought out for asthma and also easy to log items specific to my needs.  Only big wish is that it was easier to link events to chart data in the app, but you can export the raw data to manipulate elsewhere.", "timestamp": 1417331039}, {"rating": 4, "review": "This app works well for tracking my asthma symptoms. I would give it 5 stars if it had the option to show the entries in a calendar format rather than a list. Thanks!", "timestamp": 1415576593}, {"rating": 5, "review": "I've used asthmaTrack for several years. I can add or remove fields from each of the Quick Entry forms. \n\nIt's fast and easy to input values. \n\nI wish they had more videos showing the different ways to change settings.", "timestamp": 1407242192}, {"rating": 4, "review": "While I have not used the section on meds, tracking everything else is easy. I love the ability to see a graph of my historical readings. I can quickly see how I am doing overall both short-term and long-term.", "timestamp": 1405477388}, {"rating": 1, "review": "This app is NOT useful.  It take three entries to track one asthma attack and medicine dose. It should be easier than this.  I also could not find a way to add all the medication I am taking.  It's not a very complete or easy way to track asthma.  I wish I did not waste my money on this.", "timestamp": 1404265676}, {"rating": 4, "review": "Good job. Easy to use!", "timestamp": 1402617226}, {"rating": 5, "review": "Best asthma tracking app", "timestamp": 1391870240}, {"rating": 1, "review": "App worked great until the update. After the update I lost all my data and it crashes frequently on my iPhone. Find another tracking app!", "timestamp": 1379683346}, {"rating": 4, "review": "I like this app. Great customization ability.  I have been going through some changes with my asthma and this app helped me figure out that the problem was that generic Singulair did not work for me. Once I was back on the brand all symptoms disappeared. \n\nThe only change I would like is to replace the slider with text so I could type in my exact readings.", "timestamp": 1371121409}, {"rating": 2, "review": "I like that I can track multiple family members and my graph is showing the 3 zones. HOWEVER, 1) the graph for the children doesn't show the 3 zones, 2) I have to input a new pef high for each member of my family because they are different heights, 3) interface is spotty, I have to tap more than once, 4) some functions like pressing the pollen count makes the app clothes.\n\nSince I paid for the app, it should work better. But if you're a concerned mom, it's not too helpful right now other than being a log. I'm a graph person.", "timestamp": 1353017519}, {"rating": 1, "review": "Thought this would be a good way to keep track of peak flow readings but the interface is weird and doesn't make any sense. Waste of money.", "timestamp": 1348207654}, {"rating": 4, "review": "I initially gave this app 2 stars because it kept freezing up and I would have delete and reload the app.  For whatever reason I've managing to input data without it locking up on me.\n\nI give it 4 stars until a basic guide is provided.  It shouldn't take the developer very long to write up some simple steps.  A little later a more detailed user guide would be a nice touch.", "timestamp": 1322531730}, {"rating": 4, "review": "The greatest thing about AsthmaTrack is the possibility for customization; I used the Template settings to add my exact medications (including multiple options for the different doses I sometimes take) and rearranged the symptoms to put my most common ones at the top. My doctor and I are looking for patterns in my current symptoms, so I used iPhone alarms to remind me to enter how I feel at three times throughout the day. I'd recommend grouping related symptoms in the default templates and allowing export of csv, but that's it.  With all the customization options, I think this app could work for anyone.", "timestamp": 1315060412}], "KagenAir": [{"rating": 5, "review": "Easy to use app for monitoring allergies.  Connects weather, pollen, and symptoms to give a complete picture based on your location.", "timestamp": 1457198154}, {"rating": 5, "review": "Fantastic and easy to use. Allows me to see how the weather affects my allergies before it happens.", "timestamp": 1455809844}], "AsthmaMD": [{"rating": 5, "review": "I was diagnosed two years ago as an adult. Never had asthma growing up. This app has helped me manage and control my asthma with my Pulmonologist. Over the summer my asthma was severe and uncontrolled. We could look at the charts and see which of the new meds or inhalers were working. I recommend this app to all of my clients, my colleagues and everyone who sees me using it!!!", "timestamp": 1517758883}, {"rating": 1, "review": "I’ve been a user of this app for 6 months. I noticed today that when I tap on the white or black dots it gives the peak flow reading and date. But when I compare that reading with the diary it is inconsistent. So I checked last update in the App Store on my iPhone 6, no updates since i started it. This has great potential. I loved the diary and graph. Will continue to use diary as I think it correct but was hoping to show graph to dr as it is a quick reference to the diary. But not accurate.", "timestamp": 1517659682}, {"rating": 2, "review": "Looks like an app from a 4” phone with type blown up for modern phones. As opposed to smart. Doesn’t link with HealthKit so what’s the point?", "timestamp": 1516557249}, {"rating": 2, "review": "I really liked the app even though I didn't enter the info every day. I was upset at having to change my password. I can't see why it would be important or make a difference. I have enough passwords to keep track of, thanks very much.", "timestamp": 1505332408}, {"rating": 3, "review": "This apps crashes a lot. It looses anything that doesn't show its gone up to the cloud. \nEveryday I have to multitask and close the app. EVERYDAY!\n•I wish the app coordinated with the health app in my phone. \n•I wish it could coordinate with the weather and EPA ozone alerts to let me know hard to breathe days \n•MOST OF ALL, I wish it to stop crashing!!\nThe screen shots aren't correct. I don't have a pie chart to look at anywhere in the app. Just a line graph that tracks my highest and lowest peak flow.", "timestamp": 1500245948}, {"rating": 5, "review": "I've been using this app for several years and love it! It's been helpful keeping me organized. I can easily 'track' my peak flows at-a-glance. Great!", "timestamp": 1499548056}, {"rating": 5, "review": "My youngest has asthma, last year we participated in a study, this one app mimics our same daily routine without all the paper work. My favorite part has to be the action plan with a timer.  I'm actually excited to share his data with his doctor.", "timestamp": 1493339052}, {"rating": 5, "review": "I've been using this app for many years. My doctor and I both love it! With each update, it gets better and better. And these guys have the best customer service! They really listen to my feedback and enhance the app based on it. I can't say enough great things about this app and the people behind it.", "timestamp": 1492578404}, {"rating": 2, "review": "There's no place to input notes & comments on the diary, or to delete duplicates.", "timestamp": 1492045813}, {"rating": 1, "review": "I downloaded this app because it was suggested through the peak flow meter I purchased. It works fine for recording, but does not work when it was time to send my report to my Doctor. The report would not open, please correct immediately 👎🏾 That is the main reason I even downloaded this app😤", "timestamp": 1487574516}, {"rating": 2, "review": "Was working fine until today. For some reason the app asked me to log in even though I have always been logged in. Tried using existing info to no avail. Tried resetting password, but credentials not recognized. App no longer usable.", "timestamp": 1485483161}, {"rating": 2, "review": "This app is okay. I find it difficult to use tho', for 5 reasons:  (1) There is no glossary for terms like PEF, FEV1, PSP Code. I must Google these terms outside the app to find out what they mean. They might be buried in the directions somewhere, but if I need them, they should be readily available within the app.  (2) FAQ says that I can input a security code/ password to secure my information. And, where is this, please?  I cannot find anywhere within this app a place with an option to login with a password. On the app in my iPad, there was an initial set-up for this, but it never appears again.  There is no option to change this later.  This never appeared on the same app on my iPhone when I first set it up.  Strange.  Asthma MD Settings has no such thing. This is also not helped by Apple taking away all the app options in iPhone Settings. (3) There is no website listed in the app where user/patients can go for syncing all of this. Only a physician portal is available.  There is a website in the Apple Apps/iTunes, but this should be in the app itself.  (4) The app says that my email has not been validated.  So I press \"validate\", and get \"Check your inbox.\"  Only there is no validation email from asthmamd in my inbox.  Ever.  So my email remains invalidated.  Please fix this so that I can receive notifications.  (5) On the outside of the app is often a number, indicating that I must do something: input information, etc.  yet, when I get into the app, there is no sign where I am to input data or take an action, or fix a problem.  Please make your app more user-friendly!", "timestamp": 1481243487}, {"rating": 5, "review": "I've been using this app for a few years now. It really helps me identify triggers, recognize trends, and remember what I did the last time I had a certain issue. Works great for me!", "timestamp": 1476824510}, {"rating": 5, "review": "This has been invaluable for helping me track my asthma symptoms. I find it very easy to enter my Peak Flow levels. I'm using it in an iPhone 6 and can see a graph of my levels just by rotating my phone to landscape (horizontal) without having to push any additional buttons. \nI usually remember to enter when I've used my rescue inhaler & rarely remember to enter my daily inhaler so I can't really comment on the usefulness of the drug tracking aspect of the app nor on any other aspects such as sending reports, etc. It's a good basic tracker I can keep on my phone so it doesn't get lost, a coffee spill doesn't smear a week's worth of data (thanks to my impenetrable, ugly Anker phone case it doesn't get fried either) and I don't forget to bring it to doctor's appointments.  \nMy one complaint is that I don't have the option of entering when I take 2 puffs of my rescue inhaler. I found I could save the data from the first puff and then go ahead and enter the second puff as a separate entry. This skews the info since a one puff versus a two puff event has importance and this 'problem' is the reason I don't consistently use the drug tracker but rather rely on a different system. \nI recommend this app as a simple solution to keeping track of your levels.", "timestamp": 1476290252}, {"rating": 1, "review": "I have used this app for about a year and have really liked it. HOWEVER, something went wrong and the app no longer recognized my logon information. I contacted the support team and they did try to help, but after a while they just stopped communicating with me. I guess they couldn't resolve the issue and chose not to keep trying.  As such, I cannpt recommend the app.", "timestamp": 1474647943}, {"rating": 5, "review": "I've had asthma for 20 years. A peekflow chart, on a long scale is vital. The landscape view, with red,yellow and green background is wonderful to share with my doctor. \nI do have the suggestion of making the meds easier to change. But other than that, I LOVE this app. The reminders are wonderful, and the asthma attack plan is a logical, calm way to handle the scary situation.", "timestamp": 1471861857}, {"rating": 4, "review": "Like the app but it difficult to edit action plan. I also find it does not not accommodate setting for the newer medications that you only take 1 or 2 times a month. I like to extend the triggers section. Otherwise this app works well.", "timestamp": 1469361671}, {"rating": 5, "review": "What a great find!  I have adult onset asthma which has been bad for years. This is really helping me keep track so much better than what I've had in the past. Would like to see more space allowed for the note section, but otherwise, very happy with this app!!", "timestamp": 1466938102}, {"rating": 5, "review": "It is easy to use and share with my doctor", "timestamp": 1462744833}, {"rating": 1, "review": "In the FAQ of the app it states that your medical data, while done so anonymously, is stored on a google server and used for research. There does not appear to be a choice to opt out. Keep in mind, your birthday and email are part of your account info (not sure if that's parts of what's stored or not). I'm not ok with having my medical data pulled out of the app and used, without consent, for research or any other purpose. Deleting app.", "timestamp": 1462663797}, {"rating": 4, "review": "I've been using this app to help me track my asthma since it started flaring up. It helped me figure out that a chemical at my workplace was triggering the flare up. I do wish it included cough medicines and antibiotics in the medication list to help monitor their impact during respiratory infections. The app is very easy to use and I'm more consistent about taking my meds thanks to its reminders.", "timestamp": 1461194425}, {"rating": 5, "review": "Portable, easy to use. A huge help!", "timestamp": 1459000798}, {"rating": 5, "review": "I appreciate having a program where I can track the readings from my peak flow meter, and note my triggers and keep track of my medications. Helpful for me and my doctor!", "timestamp": 1458337376}, {"rating": 5, "review": "The app is easy to use and provides not only helpful reminders to check respiratory levels and to take medications, which makes managing asthma much easier, but also can provide reassurance that the condition is under control and, of course, warnings when it is not.", "timestamp": 1453597134}, {"rating": 5, "review": "This app helps to track how well I'm doing with my asthma it also is a great reminder about meds that have to be taken in the middle of the day. I also am able to take it my doctor and he can see what my asthma is doing its great", "timestamp": 1453560896}, {"rating": 4, "review": "I'm kind of a data person and I bought a peak flow and fev1 monitor for the first time when I started using the app.  It's been interesting to see how (poorly sometimes) my perception of my breathing matches with the stats.  I take Montelukast in the early afternoon because I usually exercise in the early evening and the reminder tool definitely is a huge help, especially on a busy day.", "timestamp": 1453472308}, {"rating": 4, "review": "1) can't delete data entries\n2) little info for newbies who just got an inhaler and instructions to monitor first with no maintenance plan yet (awaiting pft)\n3) really needs a walk through tutorial to explain how the action plan is supposed to work\n4) I'm very tech savvy --work in tech. So I'm not bad at internet. Why can't i log into the website to see my own data? Why wouldn't you enable notes by default?\n5) the rotation is not helpful on my iphone 6s\n6)Charge me a couple bucks if you need to invest in your product. It's 85% of what I want.", "timestamp": 1451023093}, {"rating": 5, "review": "I was searching for asthma tracking apps the whole night into the next day and I downloaded about 10 and each of them had something that I didn't like ,either it was interface or other factors. Asthma MDis the best quality in its clear user-friendly interface. An intuitive set up with how inputs for data go in . I'm so glad I found this and I just kind of happened to pass by it by accident I wish this was the first download I did. It was the best one !", "timestamp": 1448113410}, {"rating": 5, "review": "This is an AWESOME App!!!!", "timestamp": 1447002147}, {"rating": 4, "review": "Using this app assisted my pulmonologist keep me out of the ICU, helped me keep my changing med regimen straight, and aided my immunologist while she made the decision to put me on a new therapy regimen.", "timestamp": 1443748300}, {"rating": 5, "review": "I've been severely asthmatic for nearly 40 years. Tracking my Peak Flow and the reasons for fluctuations was a continuing struggle until I stumbled on AsthmaMD. For a brain injury survivor simple graphics are more comprehensible than lists of numbers. The interface is user friendly (once you realize that you must reorient to horizontal to view the graph!). I'm grateful to have found the app. Have been using it for about a year.", "timestamp": 1442592387}, {"rating": 5, "review": "Cloud backup and report feature are great additions.\nFor me one of the most useful iOS apps. Helps me tracking my peak flow and medication and great for discussing treatment plan with my physician.\nPlease keep up the good work and thanks.", "timestamp": 1437539205}, {"rating": 5, "review": "Loving being able to keep track of my asthma again. I have a peak flow meter, but it's docking station software became obsolete. I'm loving AsthmaMD app because it keeps track of more than just my peak flows, it allows me to enter triggers, symptoms, and even notes.  It's very helpful!! The only thing I'd change is adding another digit for FEV1. My peak flow meter measures X.XX, and the app only records X.X.", "timestamp": 1433582496}, {"rating": 1, "review": "These folks really need to work on their backend.   The app creates data that you don't enter and it drops data that you do enter.", "timestamp": 1432681145}, {"rating": 4, "review": "I have used this app for almost a year now. We've had some major and a few minor hiccups but the most recent updates have pretty well ironed out the problems. This app allows me to track all three of my asthmatic children with ease. I can enter data at a later time using the newly fixed time selection option. The chart is easy to read and the action plan is easy to follow. \nThis app is a really helpful tool. My only caveat: having had this app lose my data in the past, I send myself a report every two weeks in order to have my own backup of the data. The updates are helpful and I truly hope they will keep them up.", "timestamp": 1432588367}, {"rating": 5, "review": "This app is great. It's an easy interface and The action plan reduces a lot of the stress I have during an asthma attack. \nWhen you start the action plan, it has a countdown (30 min after 1st use, 60 min after 2nd). After the time is up, it asks how you are feeling - you can use symptoms and/or peak flow. \nIt doesn't allow you to enter this information early. So, when I get anxious after 10 minutes (has it been 30 min??) I look at the app, the countdown says 20 minutes.", "timestamp": 1431431099}, {"rating": 4, "review": "This app works great with managing PF readings. Though, I would like the ability to delete wrongly entered info (triggers & symptoms). Also, having the ability to put notes in would be very helpful.", "timestamp": 1429104960}, {"rating": 5, "review": "I installed this app to help with their peak flow meter and the app works very well.  I am more impressed with their tech support, however.  After a few days the app wouldn't work.  It turns out I had put a typo into my email address, so of course it would give an error when I tried to sign in.\nAfter days of patient help they discovered MY error and corrected it.  The app now works as intended and is helping me track my asthma.\nI highly recommend it.", "timestamp": 1427383088}, {"rating": 2, "review": "I have been using this App for more than a year to track my asthma symptoms. It used to work beautifully, until this last update. Now it crashes and freezes every time I use it. Please fix this issue because it was a very useful app.", "timestamp": 1426415821}, {"rating": 4, "review": "Toyed around with the app all day. In the end it is VERY helpful for managing multiple medications to be taken depending on condition severity. Would give 5 stars if a \"cancel\" option is included when making selections. Once you click on an option there is no going back, even if pressed accidentally. It took me adding and deleting the app 3 times to get my child's profile where it needed to be. Works great once you get it right!", "timestamp": 1425663626}, {"rating": 1, "review": "With the last previous updates, AsthmaMD had lost many of the features that made it useful. It is difficult to adjust the day and time unless it is the very first thing you do. It has also started dropping information. For example I check peak flows morning and night. Randomly either the next morning or in the evening the previous record will be gone. Also the monitor for adherence with medication is broke. For the last three weeks my adherence has been zero, but I've taken my medication as prescribed. As someone else noted it records my rescue inhaler even though I haven't used it.", "timestamp": 1419936607}, {"rating": 1, "review": "Looking for an app to record and track your peak flow? Look elsewhere. Recording the date and number on notepad is better than this app. It promises fancy charts and analysis, but fails at the most basic function of recording your peak flow and making the data available to view.", "timestamp": 1418483645}, {"rating": 2, "review": "In the past I would have given this app a 5. But the developers have not kept up with the changes in ISO 8. When I put my Asthma control Meds in now it automatically adds all of my rescue meds to the list I supposedly took.", "timestamp": 1418122933}, {"rating": 1, "review": "After last update lost all data and can not log into my account. It closes when I try. I'm very upset since this app been my main tool to keep track of my asthma/COPD and helps my doctor too.", "timestamp": 1416423055}, {"rating": 5, "review": "Update 2014 nov.  Much better and full featured including meds tracking. I wish it plotted both peak flow and fev1\nI finally have an app that let's me track measurements and other data in a consistent way.  Thanks\n\nPs one difficulty... If I put my peak flow in... And it is in what the program calls normal (significantly less than my normal) and I put in symptoms, it erases the peak flow... Saying the symptoms are worst...  So can can record symptoms if leak flow is rated green", "timestamp": 1415982596}, {"rating": 1, "review": "Just lost all my data after the 11/14/14 update.", "timestamp": 1415929387}, {"rating": 2, "review": "Like others here, I also lost my data and can’t get logged into my account/reset the password. I also experienced the problem someone else mentioned where adjusting the time for an entry was ignored and entries always use the current date/time no matter what you select.", "timestamp": 1414532765}, {"rating": 2, "review": "Very frustrating that you can not use the app without entering an e-mail address and password! The last time my daughter had an asthma attack it kept changing the time to the current time, not the actual time I had entered. It does have a nice look to it.", "timestamp": 1411240904}, {"rating": 5, "review": "I love how easy this app is to use. Now I don't have to keep a paper journal with us. I can enter the data at anytime. And I can email the data to the doctor. Makes asthma management more efficient. It's also a great learning tool for my child that has asthma. It teaches my child to manage their asthma and take control of their health.", "timestamp": 1409344613}, {"rating": 5, "review": "No problems so far. I was glad to see that you can put in past data for your peak flow meter. After downloading I logged in and out a few times to make sure i didn't have the same problem as in one review. You can email it to yourself to print and take to the doctors. Great app", "timestamp": 1408585458}], "Asthma Tracker": [{"rating": 4, "review": "This is the best Asthma tracker I have found in the App Store. It has the best looking interface and is very simple and easy to use. Data (peak flow, inhaler usage, and symptoms) can easily and quickly be entered. \n\nMy two requests... the app does pass peak flow data into the Apple Health App but does not pass inhaler usage. I can't decide if I want to continue using the application for this reason so please add the feature. \n\nSecondly, I would like to see a widget for rapid entry of data, particularly inhaler usage. Symptoms would be a plus to. It would also be nice to have an AppleWatch app for adding data although that would be my least priority and not a big deal.", "timestamp": 1483450162}, {"rating": 5, "review": "Thanks for fixing the bugs. I like this app a lot and as an asthma educator I recommend this app all the time, but with IOS 9 it never worked. Now it does yay! My patients are all pediatrics, so parents of young children like this app as well as teens. Now if only you could make it so you could track more than one person using the same app on the same phone. For example parents who have more than one person in the family with asthma.", "timestamp": 1444373222}, {"rating": 4, "review": "I like this asthma tracker because is simple/easy to use and you do not need to create an account. I would like to see the ability to have multiple entries per day and the option to add pulse/ox.", "timestamp": 1442332451}], "My Asthma Pal": [{"rating": 1, "review": "Includes sharing, which is nice. However, you can't actually enter the action plan into the app and the app doesn't search such common drugs as cetirizine (really!). A nice idea, terribly executed.", "timestamp": 1495977505}, {"rating": 1, "review": "First the app forces you to create an account. Then it is incredibly picky, without explanation, about what password you choose. And once a password is finally accepted, the app doesn't recognize it and will not help you choose another. So I will have to find a different app to track my kids' asthma symptoms.", "timestamp": 1481108963}, {"rating": 4, "review": "I was able to create an account easily. I wish there were options to create another person in the acct, myself and my child have asthma. I also wish I was able to put our allergy medications as part of our treatments. I like the asthma action plan but hard to read. I like being able to check in but wish I could check symptoms I am having. Otherwise it is a great check in type app and allows for reminders to be set.", "timestamp": 1478885176}, {"rating": 1, "review": "First of all, it is annoying to have to create an account in order to test out an app.  Secondly, the app will not let me create an account. For some reason, it does not like the passwords that I try. However it gives me no feedback as to why.", "timestamp": 1476921177}, {"rating": 1, "review": "I got this to monitor my son's asthma. When I open the app it does not let u get very much entered before the app freezes. The last time I could not enter anything.", "timestamp": 1458517100}], "Wizdy Pets - Kids asthma game": [{"rating": 3, "review": "My child struggles to use his inhaler properly. He wants to rush through. He is much more compliant when he watches an instructional video that paces the breath in, the hold and the slow release. I was hoping that helping the pet use the inhaler would include these pacing guides.", "timestamp": 1521508671}, {"rating": 5, "review": "I downloaded this game before the holidays in anticipation of having my niece with asthma The game made me very aware of all the triggers in my house that could affect my niece. Much more fun & more memorable than reading a list!\nI still play it for fun, even though she's come & gone!", "timestamp": 1480696849}, {"rating": 3, "review": "My 9yr old has asthma and loves playing this game but it freezes up at level 7 and won't allow her to administer the inhaler.  Hope this can be fixed, daughter loves the game!", "timestamp": 1430458847}, {"rating": 1, "review": "We updated the app and now it won't get passed the first \"do you have asthma\" question. Select yes or no and it doesn't do anything. My son used to love this app. Now he can't play it.", "timestamp": 1416418557}, {"rating": 5, "review": "Very Good Game.", "timestamp": 1414926640}, {"rating": 2, "review": "My 5 year old loves this app! He loves to give his pet (he named him Wolfie) his puffs. We have been waiting for new content for a bit, but he has been content to continue playing for now. With the new update, the app is frozen on the reward page. Bummer!", "timestamp": 1413210296}, {"rating": 5, "review": "It's a good games for little kids they will get entertain a lot ...\"...\"...\"...\"", "timestamp": 1410480444}, {"rating": 4, "review": "My kids love this game.\nBut, the backpack won't open, so our guy will soon starve.\n\nDevelopers, please help save our pet!", "timestamp": 1406110346}, {"rating": 4, "review": "This is a great little game, back pack not working can't wait to see more side games :)", "timestamp": 1405807031}, {"rating": 1, "review": "Terrible", "timestamp": 1404726665}, {"rating": 5, "review": "As a registered nurse, this was a fun way to reinforce my knowledge of administering asthma medication by inhalers. This game app has made learning fun and informative, and I hope to see it branch out even further, perhaps to other popular illnesses and conditions I am bound to encounter in my profession.", "timestamp": 1403355551}, {"rating": 2, "review": "Can't open backpack to access food and rescue inhaler in current version.", "timestamp": 1403201553}, {"rating": 5, "review": "Great app!  Games are very addicting and fun!", "timestamp": 1398204202}, {"rating": 4, "review": "Great educational app for families with asthma!", "timestamp": 1395594275}, {"rating": 5, "review": "This is such a fantastic idea. The game is intuitive and really fun to play! Love the fire breathing dragons. The asthma theme definitely help children develop more positive association with fighting asthma and staying healthy. Keep up the good work!", "timestamp": 1394927675}, {"rating": 5, "review": "As a medical student I found this game a great way for kids to learn to manage their asthma symptoms while at the same time playing. I would recommend this app!", "timestamp": 1394211678}, {"rating": 5, "review": "I have been waiting for this app to come out since hearing about you guys on Boston's CBS radio. My 7 yr old girl has asthma, she's quite good with her medication but she doesnt associate asthma with positive things and often felt alone on this journey. I have been trying to get her a \"pet\" that has similar conditions as a companion, and Wellapets is perfect! Its easily transportable and quick to learn. My daughter loves it and already told her clinician about it to tell other kids!! Thanks wellapets team!!", "timestamp": 1394129599}, {"rating": 5, "review": "I had been following Wellapets for a while because I have a young niece with asthma that I see all the time. I purchased the app so she could play when she visits, and she absolutely loves it. I recommend this to anyone with young children with asthma, it teaches them how to use their inhaler while they are having fun!", "timestamp": 1394063429}, {"rating": 5, "review": "Educationally informative for health conscious behavior that is designed to be fun! A fantastic app that my kids are enjoying!", "timestamp": 1394045414}, {"rating": 5, "review": "This is a great app for kids with asthma! So fun to play and has a lot of useful skills to manage asthma that can be learned!", "timestamp": 1394020693}, {"rating": 4, "review": "I'm trying to get my daughter to take better care of her asthma, and Wellapets is an awesome, easy-to-use app to do that. I have high expectations for the results, as it's a very comprehensive way to think about your health but also fun for kids. Great idea. I'm hoping there's an adult version coming soon, because some of my older relatives could definitely benefit from this type of education!!", "timestamp": 1394019195}, {"rating": 5, "review": "The game provides an excellent outlet for children living with asthma to share their experiences with their new adorable little pet dragon! Taking the steps necessary to ensure that the pet dragon can breathe fire allows the child to take control of what would otherwise be a burden and make their experiences the source of empowerment. With every level up the player has succeeded in identifying triggers, managing their effects, and maintaining that optimal level of \"fire\" necessary to defeat the smog monster! It is a wonderfully creative and effective way to manage asthma!", "timestamp": 1393987720}], "The Allergy, Asthma and Sinus Center": [{"rating": 1, "review": "Doesn't work! Multiple errors and slows your phone down!", "timestamp": 1486571013}, {"rating": 1, "review": "I've had this app 1 week.  On Sunday I looked at it, and it still had the previous Thursday's report.  Today (Thursday, 11:30 Central), it still shows Wednesday's report.", "timestamp": 1444314926}, {"rating": 1, "review": "I'm looking for a pollen count app, but this one is ONLY for residents of TN. What a disappointment!", "timestamp": 1393505767}, {"rating": 1, "review": "This app appears to list only locations in TN which does me no good since I don't live anywhere near TN.", "timestamp": 1380857080}, {"rating": 2, "review": "Calendar app doesn't work for injection schedule.", "timestamp": 1376920073}, {"rating": 1, "review": "I read the other reviews and thought \"I have try this!\" And they're all correct - this thing does nothing. I can't believe that on May 13 there is zero pollen of any kind in Tennessee.", "timestamp": 1368448366}, {"rating": 1, "review": "Save your money. This app does NOT work.", "timestamp": 1368443488}, {"rating": 1, "review": "I have tried this app twice!! Nothing on it works!!!!! Do not get!!!!!!!!!!!!", "timestamp": 1367762338}, {"rating": 1, "review": "Won't tell anything about My area. It's just a lame advertisement!", "timestamp": 1367590058}, {"rating": 1, "review": "Was working now isn't. No settings available. Going to remove it and let weather channel send me pollen alerts", "timestamp": 1366742445}, {"rating": 1, "review": "This app just doesn't work. No settings, no way to set a location, just a blank graph screen. Plus one, clearly fake review that leads me to believe the developers are busier crafting fake reviews than making apps that work. Really sad.", "timestamp": 1366649020}, {"rating": 1, "review": "Not working.", "timestamp": 1365830287}, {"rating": 1, "review": "Nothing displayed for Atlanta.", "timestamp": 1365440965}, {"rating": 1, "review": "Seems to be stuck on Knoxville TN. Not usable.", "timestamp": 1365395541}, {"rating": 5, "review": "The first version had some bugs, but the new version looks and works great!", "timestamp": 1356126914}, {"rating": 1, "review": "Completely worthless code errors make it not work at all", "timestamp": 1350692004}], "How To Use Inhalers for iPad": [{"rating": 1, "review": "As a nurse practitioner in a very busy pulmonary clinic, I find this app to be unrealistic and misleading. I have patients who will go to sign up for the free iPad app receiving one tutorial and then will be prompted back to the App Store to purchase another app to continue to learn about their inhalers. This was not expected and although a minimal cost, was misleading.", "timestamp": 1516233291}, {"rating": 5, "review": "As a respiratory therapist working in a large academic medical center specifically with asthma and COPD patients, I was interested in this app.\nThe cost was reasonable, and I have been pleased with functionality.  I was also happy to see Ellipta inhaler device added once BREO was on the market, as the app stated updates would occur.  Overall I have found the instructions to be accurate, and I see this app being used in hospitals, clinics and physician offices for patient education.", "timestamp": 1411656705}, {"rating": 4, "review": "Good", "timestamp": 1360765902}], "Asthma Journal Pro": [{"rating": 1, "review": "Is there a way to get my message net back!  This is absolutely worthless & very DATED.  It doesn't tell you that till AFTER you buy it.  It then has a pop up that states \"developed has not provided an update, may not work on future....", "timestamp": 1500142087}, {"rating": 4, "review": "When I posted my previous review of this product, I thought one could not customize the medications and triggers list, but it turns out that you can--it's just hard to figure out.  Instead of being able to add new medications and triggers through the daily journals screens, you have to go to \"info\" at the bottom, click on medications or triggers, and then add new ones.  Not very intuitive, but at least you can do it. So it has almost all the capability I'd like to see, just not in the most intuitive form.\n\nOne other thing that would be nice to have:  an inhaler counter, so that one can keep track of how many puffs one has used in one's inhaler(s), and so one can know how many are left.  Also, it would be good to be able to keep track of more than one inhaler (I have two I use daily).  ", "timestamp": 1267205970}, {"rating": 5, "review": "I was just thinking it would be nice to have an app like this and I saw this today.  I just started using it, and it seems to be perfect for my needs.", "timestamp": 1249663602}, {"rating": 5, "review": "This is an awesome app. Well thought out and detailed in it's coverage of asthma symptoms and metrics. The ability to push facebook notifications lets people who are in my special interest group including my doctor help me with advise. Looking forward to the Google Health integration.", "timestamp": 1248010726}]}